{"format": "layers-model", "generatedBy": "keras v3.14.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.14.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 190, 200, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "TFSMLayer", "config": {"name": "tfsm_layer", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filepath": "C:\\Users\\rumah\\Downloads\\image-classification-dicoding\\saved_model\\content\\mymodel", "call_endpoint": "serving_default", "call_training_endpoint": null}, "name": "tfsm_layer", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 190, 200, 3], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {"training": false}}]}], "input_layers": ["input_layer", 0, 0], "output_layers": {"output_0": ["tfsm_layer", 0, 0]}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "sequential_1_conv2d_4_kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "sequential_1_conv2d_4_bias", "shape": [32], "dtype": "float32"}, {"name": "sequential_1_conv2d_5_kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "sequential_1_conv2d_5_bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_1_conv2d_6_kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "sequential_1_conv2d_6_bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_1_conv2d_7_kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "sequential_1_conv2d_7_bias", "shape": [128], "dtype": "float32"}, {"name": "sequential_1_dense_2_kernel", "shape": [12800, 64], "dtype": "float32"}, {"name": "sequential_1_dense_2_bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_1_dense_3_kernel", "shape": [64, 4], "dtype": "float32"}, {"name": "sequential_1_dense_3_bias", "shape": [4], "dtype": "float32"}]}]}